/**
 * 1. Доделайте класс EUCountry. У страны есть название, количество населения и количество денег в бюджете
 * 2. У всех стран Евросоюза есть один общий счет. На нем изначально пусть будет 1 млрд евро.
 * 3. У каждой страны должен быть метод, 100 000 евро из бюджета страны в общий бюджет Евросоюза. Но если денег
 * в бюджете страны меньше 100 000, то не отправляет и как-то дает понять об этом вызывающему коду.
 * 4. У каждой страны есть метод "попросить денег", который выдает запрошенное количество денег из общего бюджета.
 * Метод делает это всегда, если страна называется Греция. И с вероятностью 20% для других стран.
 * 5. У каждой страны должен быть метод, собирающий налоги в расчете: количество населения / 10 000.
 * Он увеличивает количество денег в бюджете страны по этим формулам.
 * 6. Все использованные выше константы храните в статических полях класса EUCountry.
 * 7. Создай список стран на основании следующих данных:
 *
 * Греция: население 10 млн, бюджет 300 000
 * Испания: население 46 млн, бюджет 500 000
 * Германия: население 82 млн, бюджет 1,5 млн
 * Франция: население 66 млн, бюджет 1,2 млн
 *
 * 8. Каждый год в стране происходят следующие события: 1. сбор налогов, 2. перевод денег в общий бюджет, 3. если
 * перевести денег не получилось, то страна просит денег у Евросоюза. Сымитируйте пять лет из жизни стран.
 */

class EUCountry {
    // do some politics
}
